* AmongNurse
#+name: AmongNurse
#+RESULTS: AmongNurse-calc
| m |  w | r | i | c |  h | nodes | fails |   iter |   time | solns | relativeFails |
|---+----+---+---+---+----+-------+-------+--------+--------+-------+---------------|
| 1 |  1 | 0 | 0 | 1 | 40 | 11577 |  5784 |  17372 |  0.659 |     1 |             1 |
| 1 |  2 | 0 | 1 | 1 | 40 |  2395 |  1193 |   3599 |  0.329 |     1 |    0.20625864 |
| 1 |  4 | 0 | 1 | 1 | 40 |  1769 |   880 |   3008 |  0.528 |     1 |    0.15214385 |
| 1 |  8 | 0 | 1 | 1 | 40 |  1019 |   505 |   1645 |  0.518 |     1 |   0.087309820 |
| 1 | 16 | 0 | 1 | 1 | 40 |   149 |    70 |    255 |  0.201 |     1 |   0.012102351 |
| 1 | 32 | 0 | 1 | 1 | 40 |    63 |    27 |    123 |  0.173 |     1 |  4.6680498e-3 |
| 1 | 64 | 0 | 1 | 1 | 40 |    31 |    11 |     61 |   0.18 |     1 |  1.9017981e-3 |
| 1 |  1 | 0 | 0 | 1 | 50 | 11579 |  5784 |  17376 |  1.014 |     1 |     525.81818 |
| 1 |  2 | 0 | 1 | 1 | 50 |  2397 |  1193 |   3603 |  0.528 |     1 |    0.20625864 |
| 1 |  4 | 0 | 1 | 1 | 50 |  1771 |   880 |   3012 |  0.941 |     1 |    0.73763621 |
| 1 |  8 | 0 | 1 | 1 | 50 |  1021 |   505 |   1649 |  0.923 |     1 |    0.57386364 |
| 1 | 16 | 0 | 1 | 1 | 50 |   151 |    70 |    259 |  0.335 |     1 |    0.13861386 |
| 1 | 32 | 0 | 1 | 1 | 50 |    65 |    27 |    127 |   0.32 |     1 |    0.38571429 |
| 1 | 64 | 0 | 1 | 1 | 50 |    33 |    11 |     65 |  0.325 |     1 |    0.40740741 |
| 1 |  1 | 0 | 0 | 1 | 60 | 11579 |  5784 |  17376 |  1.343 |     1 |     525.81818 |
| 1 |  2 | 0 | 1 | 1 | 60 |  2397 |  1193 |   3603 |  0.737 |     1 |    0.20625864 |
| 1 |  4 | 0 | 1 | 1 | 60 |  1771 |   880 |   3012 |  1.386 |     1 |    0.73763621 |
| 1 |  8 | 0 | 1 | 1 | 60 |  1021 |   505 |   1649 |  1.357 |     1 |    0.57386364 |
| 1 | 16 | 0 | 1 | 1 | 60 |   153 |    71 |    262 |  0.508 |     1 |    0.14059406 |
| 1 | 32 | 0 | 1 | 1 | 60 |    63 |    26 |    124 |  0.515 |     1 |    0.36619718 |
| 1 | 64 | 0 | 1 | 1 | 60 |    33 |    11 |     65 |  0.479 |     1 |    0.42307692 |
| 1 |  1 | 0 | 0 | 1 | 70 | 11581 |  5784 |  17380 |  1.709 |     1 |     525.81818 |
| 1 |  2 | 0 | 1 | 1 | 70 |  2399 |  1193 |   3607 |  0.937 |     1 |    0.20625864 |
| 1 |  4 | 0 | 1 | 1 | 70 |  1773 |   880 |   3016 |  1.878 |     1 |    0.73763621 |
| 1 |  8 | 0 | 1 | 1 | 70 |  1023 |   505 |   1653 |  1.977 |     1 |    0.57386364 |
| 1 | 16 | 0 | 1 | 1 | 70 |   155 |    71 |    266 |  0.723 |     1 |    0.14059406 |
| 1 | 32 | 0 | 1 | 1 | 70 |    65 |    26 |    128 |  0.758 |     1 |    0.36619718 |
| 1 | 64 | 0 | 1 | 1 | 70 |    35 |    11 |     70 |  0.672 |     1 |    0.42307692 |
| 1 |  1 | 0 | 0 | 1 | 80 | 11583 |  5784 |  17384 |  2.175 |     1 |     525.81818 |
| 1 |  2 | 0 | 1 | 1 | 80 |  2401 |  1193 |   3611 |  1.207 |     1 |    0.20625864 |
| 1 |  4 | 0 | 1 | 1 | 80 |  1775 |   880 |   3020 |  2.433 |     1 |    0.73763621 |
| 1 |  8 | 0 | 1 | 1 | 80 |  1025 |   505 |   1657 |  2.476 |     1 |    0.57386364 |
| 1 | 16 | 0 | 1 | 1 | 80 |   157 |    71 |    270 |  0.954 |     1 |    0.14059406 |
| 1 | 32 | 0 | 1 | 1 | 80 |    67 |    26 |    132 |  1.084 |     1 |    0.36619718 |
| 1 | 64 | 0 | 1 | 1 | 80 |    37 |    11 |     74 |  0.953 |     1 |    0.42307692 |
| 1 |  1 | 0 | 0 | 2 | 40 | 95054 | 47525 | 142585 |  5.505 |     1 |     4320.4545 |
| 1 |  2 | 0 | 1 | 2 | 40 | 26812 | 13404 |  40223 |  3.144 |     1 |    0.28204103 |
| 1 |  4 | 0 | 1 | 2 | 40 | 17736 |  8866 |  29001 |  4.523 |     1 |    0.66144434 |
| 1 |  8 | 0 | 1 | 2 | 40 |  7306 |  3651 |  12410 |  3.454 |     1 |    0.41179788 |
| 1 | 16 | 0 | 1 | 2 | 40 |  2692 |  1344 |   4650 |  2.335 |     1 |    0.36811832 |
| 1 | 32 | 0 | 1 | 2 | 40 |   876 |   436 |   1460 |  1.601 |     1 |    0.32440476 |
| 1 | 64 | 0 | 1 | 2 | 40 |   406 |   201 |    640 |   1.52 |     1 |    0.46100917 |
| 1 |  1 | 0 | 0 | 2 | 50 | 95054 | 47525 | 142585 |  8.601 |     1 |     236.44279 |
| 1 |  2 | 0 | 1 | 2 | 50 | 26812 | 13404 |  40223 |  5.042 |     1 |    0.28204103 |
| 1 |  4 | 0 | 1 | 2 | 50 | 17736 |  8866 |  29001 |  8.742 |     1 |    0.66144434 |
| 1 |  8 | 0 | 1 | 2 | 50 |  7306 |  3651 |  12410 |  6.929 |     1 |    0.41179788 |
| 1 | 16 | 0 | 1 | 2 | 50 |  2692 |  1344 |   4650 |  4.486 |     1 |    0.36811832 |
| 1 | 32 | 0 | 1 | 2 | 50 |   876 |   436 |   1460 |  3.106 |     1 |    0.32440476 |
| 1 | 64 | 0 | 1 | 2 | 50 |   406 |   201 |    640 |  3.163 |     1 |    0.46100917 |
| 1 |  1 | 0 | 0 | 2 | 60 | 95054 | 47525 | 142585 | 12.181 |     1 |     236.44279 |
| 1 |  2 | 0 | 1 | 2 | 60 | 26812 | 13404 |  40223 |  7.112 |     1 |    0.28204103 |
| 1 |  4 | 0 | 1 | 2 | 60 | 17736 |  8866 |  29001 | 12.905 |     1 |    0.66144434 |
| 1 |  8 | 0 | 1 | 2 | 60 |  7306 |  3651 |  12410 |  9.719 |     1 |    0.41179788 |
| 1 | 16 | 0 | 1 | 2 | 60 |  2692 |  1344 |   4650 |  7.367 |     1 |    0.36811832 |
| 1 | 32 | 0 | 1 | 2 | 60 |   876 |   436 |   1460 |  5.059 |     1 |    0.32440476 |
| 1 | 64 | 0 | 1 | 2 | 60 |   400 |   198 |    626 |  4.522 |     1 |    0.45412844 |
| 1 |  1 | 0 | 0 | 2 | 70 | 95054 | 47525 | 142585 |  14.71 |     1 |     240.02525 |
| 1 |  2 | 0 | 1 | 2 | 70 | 26812 | 13404 |  40223 |  9.391 |     1 |    0.28204103 |
| 1 |  4 | 0 | 1 | 2 | 70 | 17736 |  8866 |  29001 | 17.247 |     1 |    0.66144434 |
| 1 |  8 | 0 | 1 | 2 | 70 |  7306 |  3651 |  12410 | 13.642 |     1 |    0.41179788 |
| 1 | 16 | 0 | 1 | 2 | 70 |  2692 |  1344 |   4650 | 10.376 |     1 |    0.36811832 |
| 1 | 32 | 0 | 1 | 2 | 70 |   876 |   436 |   1460 |  7.221 |     1 |    0.32440476 |
| 1 | 64 | 0 | 1 | 2 | 70 |   400 |   198 |    626 |  6.169 |     1 |    0.45412844 |
| 1 |  1 | 0 | 0 | 2 | 80 | 95054 | 47525 | 142585 | 18.052 |     1 |     240.02525 |
| 1 |  2 | 0 | 1 | 2 | 80 | 26812 | 13404 |  40223 | 11.949 |     1 |    0.28204103 |
| 1 |  4 | 0 | 1 | 2 | 80 | 17736 |  8866 |  29001 |  22.84 |     1 |    0.66144434 |
| 1 |  8 | 0 | 1 | 2 | 80 |  7306 |  3651 |  12410 | 18.235 |     1 |    0.41179788 |
| 1 | 16 | 0 | 1 | 2 | 80 |  2692 |  1344 |   4650 | 13.457 |     1 |    0.36811832 |
| 1 | 32 | 0 | 1 | 2 | 80 |   876 |   436 |   1460 |  9.123 |     1 |    0.32440476 |
| 1 | 64 | 0 | 1 | 2 | 80 |   400 |   198 |    626 |  9.258 |     1 |    0.45412844 |
| 1 |  1 | 0 | 0 | 3 | 40 | 22821 | 11405 |  34239 |  1.291 |     1 |     57.601010 |
| 1 |  2 | 0 | 1 | 3 | 40 |  4133 |  2061 |   6207 |  0.558 |     1 |    0.18071021 |
| 1 |  4 | 0 | 1 | 3 | 40 |  4945 |  2467 |   8063 |  1.513 |     1 |     1.1969918 |
| 1 |  8 | 0 | 1 | 3 | 40 |  1917 |   953 |   3187 |   0.91 |     1 |    0.38629915 |
| 1 | 16 | 0 | 1 | 3 | 40 |   361 |   175 |    589 |  0.362 |     1 |    0.18363064 |
| 1 | 32 | 0 | 1 | 3 | 40 |   167 |    78 |    278 |   0.35 |     1 |    0.44571429 |
| 1 | 64 | 0 | 1 | 3 | 40 |   115 |    52 |    199 |  0.481 |     1 |    0.66666667 |
| 1 |  1 | 0 | 0 | 3 | 50 | 22823 | 11405 |  34243 |  2.012 |     1 |     219.32692 |
| 1 |  2 | 0 | 1 | 3 | 50 |  4135 |  2061 |   6211 |  0.897 |     1 |    0.18071021 |
| 1 |  4 | 0 | 1 | 3 | 50 |  4945 |  2466 |   8066 |  2.493 |     1 |     1.1965066 |
| 1 |  8 | 0 | 1 | 3 | 50 |  1919 |   953 |   3191 |  1.805 |     1 |    0.38645580 |
| 1 | 16 | 0 | 1 | 3 | 50 |   363 |   175 |    593 |  0.712 |     1 |    0.18363064 |
| 1 | 32 | 0 | 1 | 3 | 50 |   169 |    78 |    282 |  0.691 |     1 |    0.44571429 |
| 1 | 64 | 0 | 1 | 3 | 50 |   117 |    52 |    203 |  0.956 |     1 |    0.66666667 |
| 1 |  1 | 0 | 0 | 3 | 60 | 22825 | 11405 |  34247 |  2.651 |     1 |     219.32692 |
| 1 |  2 | 0 | 1 | 3 | 60 |  4137 |  2061 |   6215 |  1.253 |     1 |    0.18071021 |
| 1 |  4 | 0 | 1 | 3 | 60 |  4947 |  2466 |   8068 |   4.63 |     1 |     1.1965066 |
| 1 |  8 | 0 | 1 | 3 | 60 |  1921 |   953 |   3195 |  2.704 |     1 |    0.38645580 |
| 1 | 16 | 0 | 1 | 3 | 60 |   365 |   175 |    597 |  1.116 |     1 |    0.18363064 |
| 1 | 32 | 0 | 1 | 3 | 60 |   171 |    78 |    286 |  1.029 |     1 |    0.44571429 |
| 1 | 64 | 0 | 1 | 3 | 60 |   119 |    52 |    207 |  1.669 |     1 |    0.66666667 |
| 1 |  1 | 0 | 0 | 3 | 70 | 22827 | 11405 |  34251 |  3.425 |     1 |     219.32692 |
| 1 |  2 | 0 | 1 | 3 | 70 |  4139 |  2061 |   6219 |  1.622 |     1 |    0.18071021 |
| 1 |  4 | 0 | 1 | 3 | 70 |  4949 |  2466 |   8072 |  6.433 |     1 |     1.1965066 |
| 1 |  8 | 0 | 1 | 3 | 70 |  1923 |   953 |   3199 |  3.698 |     1 |    0.38645580 |
| 1 | 16 | 0 | 1 | 3 | 70 |   367 |   175 |    601 |  1.495 |     1 |    0.18363064 |
| 1 | 32 | 0 | 1 | 3 | 70 |   173 |    78 |    290 |   1.51 |     1 |    0.44571429 |
| 1 | 64 | 0 | 1 | 3 | 70 |   121 |    52 |    212 |  2.281 |     1 |    0.66666667 |
| 1 |  1 | 0 | 0 | 3 | 80 | 22829 | 11405 |  34255 |  4.266 |     1 |     219.32692 |
| 1 |  2 | 0 | 1 | 3 | 80 |  4141 |  2061 |   6223 |  2.067 |     1 |    0.18071021 |
| 1 |  4 | 0 | 1 | 3 | 80 |  4951 |  2466 |   8076 |  6.761 |     1 |     1.1965066 |
| 1 |  8 | 0 | 1 | 3 | 80 |  1925 |   953 |   3203 |  4.971 |     1 |    0.38645580 |
| 1 | 16 | 0 | 1 | 3 | 80 |   369 |   175 |    605 |  1.931 |     1 |    0.18363064 |
| 1 | 32 | 0 | 1 | 3 | 80 |   175 |    78 |    295 |  1.954 |     1 |    0.44571429 |
| 1 | 64 | 0 | 1 | 3 | 80 |   123 |    52 |    217 |  2.975 |     1 |    0.66666667 |
#+TBLFM: @2$12=$8/$8 :: @3$12=$8/@-1$8 :: @4$12=$8/@-2$8 :: @5$12=$8/@-3$8 :: @6$12=$8/@-4$8 :: @7$12=$8/@-5$8 :: @8$12=$8/@-6$8 :: @9$12=$8/$8 :: @10$12=$8/@-1$8 :: @11$12=$8/@-2$8 :: @12$12=$8/@-3$8 :: @13$12=$8/@-4$8 :: @14$12=$8/@-5$8 :: @15$12=$8/@-6$8 :: @16$12=$8/$8 :: @17$12=$8/@-1$8 :: @18$12=$8/@-2$8 :: @19$12=$8/@-3$8 :: @20$12=$8/@-4$8 :: @21$12=$8/@-5$8 :: @22$12=$8/@-6$8 :: @23$12=$8/$8 :: @24$12=$8/@-1$8 :: @25$12=$8/@-2$8 :: @26$12=$8/@-3$8 :: @27$12=$8/@-4$8 :: @28$12=$8/@-5$8 :: @29$12=$8/@-6$8 :: @30$12=$8/$8 :: @31$12=$8/@-1$8 :: @32$12=$8/@-2$8 :: @33$12=$8/@-3$8 :: @34$12=$8/@-4$8 :: @35$12=$8/@-5$8 :: @36$12=$8/@-6$8 :: @37$12=$8/$8 :: @38$12=$8/@-1$8 :: @39$12=$8/@-2$8 :: @40$12=$8/@-3$8 :: @41$12=$8/@-4$8 :: @42$12=$8/@-5$8 :: @43$12=$8/@-6$8 :: @44$12=$8/$8 :: @45$12=$8/@-1$8 :: @46$12=$8/@-2$8 :: @47$12=$8/@-3$8 :: @48$12=$8/@-4$8 :: @49$12=$8/@-5$8 :: @50$12=$8/@-6$8 :: @51$12=$8/$8 :: @52$12=$8/@-1$8 :: @53$12=$8/@-2$8 :: @54$12=$8/@-3$8 :: @55$12=$8/@-4$8 :: @56$12=$8/@-5$8 :: @57$12=$8/@-6$8 :: @58$12=$8/$8 :: @59$12=$8/@-1$8 :: @60$12=$8/@-2$8 :: @61$12=$8/@-3$8 :: @62$12=$8/@-4$8 :: @63$12=$8/@-5$8 :: @64$12=$8/@-6$8 :: @65$12=$8/$8 :: @66$12=$8/@-1$8 :: @67$12=$8/@-2$8 :: @68$12=$8/@-3$8 :: @69$12=$8/@-4$8 :: @70$12=$8/@-5$8 :: @71$12=$8/@-6$8 :: @72$12=$8/$8 :: @73$12=$8/@-1$8 :: @74$12=$8/@-2$8 :: @75$12=$8/@-3$8 :: @76$12=$8/@-4$8 :: @77$12=$8/@-5$8 :: @78$12=$8/@-6$8 :: @79$12=$8/$8 :: @80$12=$8/@-1$8 :: @81$12=$8/@-2$8 :: @82$12=$8/@-3$8 :: @83$12=$8/@-4$8 :: @84$12=$8/@-5$8 :: @85$12=$8/@-6$8 :: @86$12=$8/$8 :: @87$12=$8/@-1$8 :: @88$12=$8/@-2$8 :: @89$12=$8/@-3$8 :: @90$12=$8/@-4$8 :: @91$12=$8/@-5$8 :: @92$12=$8/@-6$8 :: @93$12=$8/$8 :: @94$12=$8/@-1$8 :: @95$12=$8/@-2$8 :: @96$12=$8/@-3$8 :: @97$12=$8/@-4$8 :: @98$12=$8/@-5$8 :: @99$12=$8/@-6$8 :: @100$12=$8/$8 :: @101$12=$8/@-1$8 :: @102$12=$8/@-2$8 :: @103$12=$8/@-3$8 :: @104$12=$8/@-4$8 :: @105$12=$8/@-5$8 :: @106$12=$8/@-6$8

#+name: AmongNurse-calc
#+Begin_SRC emacs-lisp :var table=AmongNurse
(with-temp-buffer
  (org-table-import (expand-file-name "/tmp/amongNurse.csv") nil)
  (setq LST (org-table-to-lisp))
  (setcar table (car LST))
  (setcdr table (cons 'hline (cdr LST)))
  table
)
#+END_SRC

* AllInterval
#+name: AllInterval
#+RESULTS: AllInterval-calc
| size | m |  w | r | i |  nodes |  fails |   iter |     nbCS | layers |  splitCS | pruneCS |     pot |    hitCS |   time | solns |
|------+---+----+---+---+--------+--------+--------+----------+--------+----------+---------+---------+----------+--------+-------|
|    4 | 0 |  0 | 0 | 0 |     14 |      4 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |  0.001 |     4 |
|    4 | 1 |  0 | 0 | 0 |     14 |      4 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |  0.002 |     4 |
|    4 | 2 |  1 | 0 | 0 |     14 |      4 |     35 |      143 |      7 |        0 |       0 |       0 |        0 |  0.002 |     4 |
|    4 | 2 |  2 | 0 | 1 |     12 |      3 |     38 |      324 |      7 |      103 |       5 |      28 |        0 |  0.002 |     4 |
|    4 | 2 |  4 | 0 | 1 |      8 |      1 |     24 |      340 |      7 |      163 |      11 |      67 |        2 |  0.002 |     4 |
|    4 | 2 |  8 | 0 | 1 |      6 |      0 |     19 |      311 |      7 |      181 |      34 |      94 |        7 |  0.002 |     4 |
|    4 | 2 | 16 | 0 | 1 |      6 |      0 |     16 |      234 |      7 |      173 |      29 |      98 |       28 |  0.002 |     4 |
|    4 | 2 | 32 | 0 | 1 |      6 |      0 |     15 |      245 |      7 |      362 |      48 |     117 |      182 |  0.002 |     4 |
|    4 | 2 | 64 | 0 | 1 |      6 |      0 |     15 |      304 |      7 |      623 |      72 |     166 |      383 |  0.011 |     4 |
|    4 | 3 |  1 | 0 | 0 |     14 |      4 |     22 |       56 |      7 |        0 |       0 |       0 |        0 |  0.002 |     4 |
|    4 | 3 |  2 | 0 | 1 |     10 |      2 |     25 |      191 |      7 |       65 |       4 |      20 |        0 |  0.002 |     4 |
|    4 | 3 |  4 | 0 | 1 |      8 |      1 |     20 |      245 |      7 |      107 |      10 |      45 |        0 |  0.002 |     4 |
|    4 | 3 |  8 | 0 | 1 |      6 |      0 |     17 |      242 |      7 |      133 |      22 |      70 |        7 |  0.002 |     4 |
|    4 | 3 | 16 | 0 | 1 |      6 |      0 |     15 |      207 |      7 |      145 |      26 |      79 |       22 |  0.003 |     4 |
|    4 | 3 | 32 | 0 | 1 |      6 |      0 |     15 |      245 |      7 |      362 |      48 |     117 |      182 |  0.002 |     4 |
|    4 | 3 | 64 | 0 | 1 |      6 |      0 |     15 |      304 |      7 |      623 |      72 |     166 |      383 |  0.002 |     4 |
|    8 | 0 |  0 | 0 | 0 |    962 |    442 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |  0.021 |    40 |
|    8 | 1 |  0 | 0 | 0 |    642 |    282 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |  0.014 |    40 |
|    8 | 2 |  1 | 0 | 0 |    642 |    282 |   1551 |     9710 |     15 |        0 |       0 |       0 |        0 |  0.031 |    40 |
|    8 | 2 |  2 | 0 | 1 |    600 |    261 |   1550 |    23761 |     15 |    10666 |     608 |    1830 |        0 |  0.076 |    40 |
|    8 | 2 |  4 | 0 | 1 |    514 |    218 |   1338 |    38265 |     15 |    22011 |    2546 |    5598 |      391 |  0.085 |    40 |
|    8 | 2 |  8 | 0 | 1 |    450 |    186 |   1185 |    56482 |     15 |    33182 |    4047 |   10077 |     1081 |  0.115 |    40 |
|    8 | 2 | 16 | 0 | 1 |    360 |    141 |    945 |    70565 |     15 |    46762 |    7529 |   14854 |     5659 |  0.142 |    40 |
|    8 | 2 | 32 | 0 | 1 |    246 |     84 |    638 |    78492 |     15 |    65818 |    8921 |   19443 |    14891 |  0.161 |    40 |
|    8 | 2 | 64 | 0 | 1 |    156 |     39 |    413 |    86544 |     15 |    79952 |   12188 |   22625 |    22210 |  0.199 |    40 |
|    8 | 3 |  1 | 0 | 0 |    642 |    282 |    722 |     2387 |     15 |        0 |       0 |       0 |        0 |  0.028 |    40 |
|    8 | 3 |  2 | 0 | 1 |    572 |    247 |    915 |    11658 |     15 |     4672 |     221 |     902 |        0 |   0.05 |    40 |
|    8 | 3 |  4 | 0 | 1 |    496 |    209 |    859 |    22350 |     15 |    11413 |    1018 |    2995 |      172 |  0.069 |    40 |
|    8 | 3 |  8 | 0 | 1 |    404 |    163 |    788 |    37214 |     15 |    20218 |    2327 |    6406 |      661 |  0.095 |    40 |
|    8 | 3 | 16 | 0 | 1 |    338 |    130 |    680 |    54105 |     15 |    33533 |    4917 |   10842 |     4241 |  0.121 |    40 |
|    8 | 3 | 32 | 0 | 1 |    230 |     76 |    486 |    58894 |     15 |    45190 |    6062 |   14018 |    10786 |  0.138 |    40 |
|    8 | 3 | 64 | 0 | 1 |    146 |     34 |    336 |    70395 |     15 |    59273 |    9378 |   17974 |    17113 |  0.183 |    40 |
|   12 | 0 |  0 | 0 | 0 | 212940 | 105143 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |  4.243 |  1328 |
|   12 | 1 |  0 | 0 | 0 |  80082 |  38714 |      0 |        0 |      0 |        0 |       0 |       0 |        0 |   2.15 |  1328 |
|   12 | 2 |  1 | 0 | 0 |  81886 |  39616 | 210016 |  1630823 |     23 |        0 |       0 |       0 |        0 |  6.574 |  1328 |
|   12 | 2 |  2 | 0 | 1 |  79722 |  38534 | 215920 |  5447032 |     23 |  3080878 |  136891 |  427372 |      745 | 13.759 |  1328 |
|   12 | 2 |  4 | 0 | 1 |  75732 |  36539 | 202033 |  8756105 |     23 |  5710278 |  520857 | 1175741 |   130065 | 18.959 |  1328 |
|   12 | 2 |  8 | 0 | 1 |  70288 |  33817 | 184018 | 13585469 |     23 |  9574320 | 1097704 | 2392940 |   653206 | 28.302 |  1328 |
|   12 | 2 | 16 | 0 | 1 |  61114 |  29230 | 157469 | 19445191 |     23 | 14785330 | 1813421 | 3949757 |  2141236 | 41.885 |  1328 |
|   12 | 2 | 32 | 0 | 1 |  48730 |  23038 | 123956 | 26223974 |     23 | 22864858 | 2859784 | 5762988 |  5158451 | 67.147 |  1328 |
|   12 | 2 | 64 | 0 | 1 |  35380 |  16363 |  89779 | 33308274 |     23 | 33373672 | 3785835 | 7801532 | 10680165 | 82.701 |  1328 |
|   12 | 3 |  1 | 0 | 0 |  80082 |  38714 |  82738 |   330765 |     23 |        0 |       0 |       0 |        0 |  4.398 |  1328 |
|   12 | 3 |  2 | 0 | 1 |  77154 |  37250 | 115608 |  2632550 |     23 |  1436199 |   58428 |  204420 |      166 |  8.763 |  1328 |
|   12 | 3 |  4 | 0 | 1 |  72870 |  35108 | 114339 |  4728695 |     23 |  2742800 |  208177 |  570298 |    51528 | 12.142 |  1328 |
|   12 | 3 |  8 | 0 | 1 |  67532 |  32439 | 110819 |  8327944 |     23 |  5151774 |  544693 | 1321875 |   302938 | 23.956 |  1328 |
|   12 | 3 | 16 | 0 | 1 |  58582 |  27964 | 101331 | 13261464 |     23 |  8587354 |  986523 | 2373573 |  1142234 | 57.224 |  1328 |
|   12 | 3 | 32 | 0 | 1 |  47062 |  22204 |  84912 | 19275506 |     23 | 14696728 | 1801677 | 3870389 |  3214151 | 49.206 |  1328 |
|   12 | 3 | 64 | 0 | 1 |  33288 |  15317 |  64000 | 25690711 |     23 | 23147943 | 2566794 | 5642247 |  7572955 | 62.934 |  1328 |

#+name: AllInterval-calc
#+Begin_SRC emacs-lisp :var table=AllInterval
(with-temp-buffer
  (org-table-import (expand-file-name "/tmp/allInterval.csv") nil)
  (setq LST (org-table-to-lisp))
  (setcar table (car LST))
  (setcdr table (cons 'hline (cdr LST)))
  table
)
#+END_SRC

* WorkForce
#+name: WorkForce
#+RESULTS: WorkForce-calc
| m | w | nodes | fails |  iter |    nbCS | layers | splitCS | pruneCS |    pot | hitCS |   time | solns |
|---+---+-------+-------+-------+---------+--------+---------+---------+--------+-------+--------+-------|
| 0 | 1 |   560 |   281 | 12187 |   75515 |    100 |       0 |       0 |      0 |     0 |   4.17 |     4 |
| 0 | 2 |   560 |   281 | 13515 | 2161003 |    100 | 1939201 |     132 |  35227 |    11 |  9.845 |     4 |
| 0 | 4 |   560 |   281 | 19388 | 3388008 |    100 | 2922311 |     527 |  87571 | 13305 | 11.723 |     4 |
| 0 | 8 |   560 |   281 | 21696 | 5121506 |    100 | 4166008 |    2040 | 165157 | 80815 | 20.869 |     4 |

#+name: WorkForce-calc
#+Begin_SRC emacs-lisp :var table=WorkForce
(with-temp-buffer
  (org-table-import (expand-file-name "/tmp/workForce.csv") nil)
  (setq LST (org-table-to-lisp))
  (setcar table (car LST))
  (setcdr table (cons 'hline (cdr LST)))
  table
)
#+END_SRC
